### Terraform Plan (prod.tfvars)
```
random_integer.eks_postfix: Refreshing state... [id=120]
data.aws_caller_identity.current: Reading...
data.aws_secretsmanager_secret.codebuild[0]: Reading...
module.ecr[0].aws_ecr_repository.backend: Refreshing state... [id=ce-prj-prd-backend-ecr]
module.route53[0].aws_route53_zone.primary: Refreshing state... [id=Z08424182TQL80T0V5BQH]
module.vpc[0].module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-066118d359975bdc6]
module.ecr[0].aws_ecr_repository.frontend: Refreshing state... [id=ce-prj-prd-frontend-ecr]
data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
data.aws_secretsmanager_secret.codebuild[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9]
data.aws_secretsmanager_secret_version.codebuild_version[0]: Reading...
data.aws_secretsmanager_secret_version.codebuild_version[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9|AWSCURRENT]
module.vpc[0].module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-091dcc764ff2b35a2]
module.vpc[0].module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0fae2ea924dc09a1f]
module.vpc[0].module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-051d93cd5990337b7]
module.vpc[0].module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0204bed93ebfe73c5]
module.vpc[0].module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06fbbc3e9646c9184]
module.vpc[0].module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02071e6be08bb4270]
module.vpc[0].module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-058325729b62f37b1]
module.vpc[0].module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00d72005ba01ac7c0]
module.vpc[0].aws_security_group.vpc_endpoints: Refreshing state... [id=sg-03cb5837e6c39a0ee]
module.vpc[0].module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-004f423ad12fca427]
module.vpc[0].module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-095a6a3bff759a86f]
module.vpc[0].module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0ceecf6c9f3d457ff]
module.vpc[0].module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0204bed93ebfe73c51080289494]
module.vpc[0].aws_security_group_rule.allow_vpc_to_vpc_endpoints: Refreshing state... [id=sgrule-767466993]
module.vpc[0].module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025eb2f364c3789ff]
module.vpc[0].module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-009dbfc334f9e269c]
module.vpc[0].aws_vpc_endpoint.sts: Refreshing state... [id=vpce-0cd86f2ffc96aa6b8]
module.vpc[0].aws_vpc_endpoint.eks: Refreshing state... [id=vpce-0d11094ee99df07e6]
module.vpc[0].aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-07bb64491617f1e72]
module.vpc[0].aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-05f55b1c04a65d766]
module.vpc[0].module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0e9c04965853435c9]
module.vpc[0].module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01704dead73e532ce]
module.vpc[0].module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f0883ca99a435521]
module.vpc[0].module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02071e6be08bb42701080289494]
module.codebuild[0].aws_codebuild_source_credential.github: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:token/github]
module.codebuild[0].aws_security_group.codebuild_sg: Refreshing state... [id=sg-00483943c297c2780]
module.codebuild[0].aws_iam_role.codebuild_role: Refreshing state... [id=CodeBuildEKSDeployRole]
module.codebuild[0].aws_iam_role_policy.codebuild_policy: Refreshing state... [id=CodeBuildEKSDeployRole:terraform-2025062617314748700000000a]
module.codebuild[0].aws_codebuild_project.eks_deploy: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:project/ce-prj-prd-codebuild]
module.codebuild[0].aws_codebuild_webhook.github: Refreshing state... [id=ce-prj-prd-codebuild]
module.eks[0].module.eks.data.aws_caller_identity.current: Reading...
module.eks[0].module.eks.data.aws_partition.current: Reading...
module.eks[0].module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks[0].module.eks.data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.data.aws_iam_session_context.current: Reading...
module.eks[0].module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::980921750296:user/Atakan]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Read complete after 1s [id=/aws/service/eks/optimized-ami/1.31/amazon-linux-2/recommended/image_id]
data.aws_eks_cluster_auth.this[0]: Reading...
data.aws_eks_cluster_auth.this[0]: Read complete after 0s [id=ce-prj-prd-eks-cluster-120]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks[0].aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-task-eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].aws_iam_role_policy_attachment.eks_node_ecr_readonly will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_ecr_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "ce-task-eks-node-group-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.eks_node_group_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_group_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "ce-task-eks-node-group-role"
    }

  # module.eks[0].aws_iam_role_policy_attachment.eks_node_group_worker_policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_group_worker_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "ce-task-eks-node-group-role"
    }

  # module.eks[0].helm_release.codebuild_rbac will be created
  + resource "helm_release" "codebuild_rbac" {
      + atomic                     = false
      + chart                      = "modules/eks/helm"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "codebuild-rbac"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.eks[0].module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks[0].module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks[0].module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/ce-prj-prd-eks-cluster-120/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "/aws/eks/ce-prj-prd-eks-cluster-120/cluster"
        }
      + tags_all          = {
          + "Name" = "/aws/eks/ce-prj-prd-eks-cluster-120/cluster"
        }
    }

  # module.eks[0].module.eks.aws_eks_access_entry.this["cluster_creator"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ce-prj-prd-eks-cluster-120"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::980921750296:user/Atakan"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks[0].module.eks.aws_eks_access_entry.this["codebuild"] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ce-prj-prd-eks-cluster-120"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "codebuild-deployers",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole"
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks[0].module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "ce-prj-prd-eks-cluster-120"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::980921750296:user/Atakan"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks[0].module.eks.aws_eks_access_policy_association.this["codebuild_deploy"] will be created
  + resource "aws_eks_access_policy_association" "this" {
      + associated_at = (known after apply)
      + cluster_name  = "ce-prj-prd-eks-cluster-120"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminPolicy"
      + principal_arn = "arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks[0].module.eks.aws_eks_addon.before_compute["vpc-cni"] will be created
  + resource "aws_eks_addon" "before_compute" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ce-prj-prd-eks-cluster-120"
      + configuration_values        = jsonencode(
            {
              + env = {
                  + ENABLE_PREFIX_DELEGATION = "true"
                  + WARM_PREFIX_TARGET       = "1"
                }
            }
        )
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "OVERWRITE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = (known after apply)

      + timeouts {}
    }

  # module.eks[0].module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ce-prj-prd-eks-cluster-120"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.31"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + timeouts {}

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-00d72005ba01ac7c0",
              + "subnet-058325729b62f37b1",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks[0].module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name" = "ce-prj-prd-eks-cluster-120-eks-irsa"
        }
      + tags_all        = {
          + "Name" = "ce-prj-prd-eks-cluster-120-eks-irsa"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks[0].module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "ce-prj-prd-eks-cluster-120-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks[0].module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ce-prj-prd-eks-cluster-120-cluster-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "ce-prj-prd-eks-cluster-120-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.eks[0].module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ce-prj-prd-eks-cluster-120-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ce-prj-prd-eks-cluster-120-cluster"
        }
      + tags_all               = {
          + "Name" = "ce-prj-prd-eks-cluster-120-cluster"
        }
      + vpc_id                 = "vpc-066118d359975bdc6"
    }

  # module.eks[0].module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ce-prj-prd-eks-cluster-120-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                             = "ce-prj-prd-eks-cluster-120-node"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "owned"
        }
      + tags_all               = {
          + "Name"                                             = "ce-prj-prd-eks-cluster-120-node"
          + "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120" = "owned"
        }
      + vpc_id                 = "vpc-066118d359975bdc6"
    }

  # module.eks[0].module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks[0].module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "ce-prj-prd-eks-cluster-120"
          + "cluster_service_cidr"               = (known after apply)
          + "cluster_version"                    = "1.31"
        }
    }

  # module.eks[0].module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::980921750296:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::980921750296:user/Atakan",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks[0].module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/ce-prj-prd-eks-cluster-120"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks[0].module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "ce-prj-prd-eks-cluster-120 cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                           = {
          + "terraform-aws-modules" = "eks"
        }
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 7
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = "example-"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + termination_policies             = []
      + vpc_zone_identifier              = [
          + "subnet-00d72005ba01ac7c0",
          + "subnet-058325729b62f37b1",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 66
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "example"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/ce-prj-prd-eks-cluster-120"
          + propagate_at_launch = false
          + value               = "owned"
        }
      + tag {
          + key                 = "k8s.io/cluster-autoscaler/enabled"
          + propagate_at_launch = false
          + value               = "true"
        }
      + tag {
          + key                 = "k8s.io/cluster/ce-prj-prd-eks-cluster-120"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/ce-prj-prd-eks-cluster-120"
          + propagate_at_launch = true
          + value               = "owned"
        }

      + timeouts {}

      + traffic_source (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_eks_access_entry.this[0] will be created
  + resource "aws_eks_access_entry" "this" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "ce-prj-prd-eks-cluster-120"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags_all          = (known after apply)
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "example-node-group-"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Self managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "example-node-group-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for example self managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-0130ec490a9ad0a89"
      + instance_type          = "t3.micro"
      + key_name               = "my-eks-key"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "example-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "example"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "example"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "example"
            }
        }
    }

  # module.eks[0].module.eks.module.self_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ eks_update_kubeconfig_command = "EKS cluster not available" -> "aws eks update-kubeconfig --name ce-prj-prd-eks-cluster-120 --region eu-central-1"

Warning: Argument is deprecated

  with module.eks[0].module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks.eks/main.tf line 393, in resource "aws_iam_role" "this":
 393: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->